{
    "personal": [
        {
            "name": "tba-1",
            "title": "TBA",
            "coverimage":"plague-cover.png",
            "hidden": false,
            "type": "game",
            "launchdate": "2021"
        },
        {
            "name": "codware-2",
            "title": "CODWare 2",
            "coverimage":"codware2-cover.jpg",
            "logoimage":"codware2-logo.png",
            "type": "game",
            "content": [
                {
                    "title": "Project Information",
                    "values": [
                        {
                            "type": "youtube",
                            "value": "https://www.youtube.com/embed/Bdep4rxs5hM"
                        },
                        {
                            "type": "outbound-url",
                            "value": "Visit Project"
                        },
                        {
                            "type": "text",
                            "value": "CODWare 2 was a complete from-scratch remake of CODWare 1. It was built to be a nice, smooth experience compared to the original version, allowing the rest of the team and I to showcase how our abilities have improved since the first installment. It also introduced several new minigames, updates to old ones, and new features like persistent player progression. For a referesher, CODWare is a gamemode where players are all in the same arena and will compete in several back-to-back minigames, each of which increases in speed as the match goes on, until the players must all face a major minigame at the end known as a \"Boss Round\". These minigames would rewards the players with points, and the player with the most points at the end of the game was declared the victor."
                        },
                        {
                            "type": "text",
                            "value": "Like its predecessor, CODWare 2's design philosophy was to provide a casual, lightly-competitive party environment for players to enjoy — where skill wasn't really the important part, and the game was mostly about having fun. It was centered around being a jump-in-and-play experience that any type of player could hop into, supporting up to 18 players — but ideally played with 8-10 players. Short minigame instruction popups and wordplay keep players on their feet and laughing with and at each other."
                        },
                        {
                            "type": "text",
                            "value": "CODWare, and CODWare 2, are both heavily inspired by TF2Ware, a modification for Team Fortress 2 that also takes inspiration from Nintendo's \"WarioWare\"."
                        },
                        {
                            "type": "text",
                            "value": "A project breakdown is available below, or you can click the \"Visit Project\" link above to check it out for yourself!"
                        }
                    ]
                },
                {
                    "title": "Responsibilities",
                    "values": [
                        {
                            "type": "text",
                            "value": "My responsibilities on this project included leading the team, designing & scripting the gamemode structure, and designing & scripting each component in the gamemode including minigames, boss games, special game rules and the overall flow of the game. I worked with the other developer on the team to provide him with requirements for each playable area for the minigame, as well as assisted in coming up with ideas for theming the world."
                        },
                        {
                            "type": "text",
                            "value": "This project allowed me to improve my system creation methods, creating cleaner and more readable systems for external developers to plug into, as well as improve overall code readability."
                        },
                        {
                            "type": "text",
                            "value": "Languages Used: GSC (Call of Duty Scripting Language), Lua"
                        }
                    ]
                },
                {
                    "title": "Sequel Changes Breakdown",
                    "values": [
                        {
                            "type": "text",
                            "value": "As CODWare 2 functions, from a gameplay perspective, nearly identically to CODWare 1, I figured I'd instead write the \"updates\" that occured in this sequelization."
                        },
                        {
                            "type": "text",
                            "value": "CODWare 2's first change involves a total rewrite of the game's systems. The minigame system has been totally replaced with an API that makes it easy to plug in new minigames, and sort them between types -- standard and boss minigames. The API allows you to introduce a blocking minigame function for the actual minigame functionality, and a secondary function for handling whether or not the player should earn a point. A secondary function is optional, and will fall back to a normal functionality where players will score a point as long as they stayed alive. Minigames in this iteration of CODWare are all split into their own files based on an internal \"Series\"; all of the minigames available in the base game are part of \"Series 1\", and are all grouped up into a single script tree. If we were to introduce a second series, they would be given their own file and can easily be plugged in with a handful of lines of code."
                        },
                        {
                            "type": "text",
                            "value": "A feature was also introduced to help with tiebreakers -- previously in CODWare, ties in score would choose the winner at random between all players with tied scoress, but in CODWare 2, players are thrown into a special tiebreaker round where they have to run to the center of a maze before all other players."
                        },
                        {
                            "type": "text",
                            "value": "Every minigame was re-written from scratch, allowing me to make more consistent feeling ones and removing the \"glitchiness\" feeling that some of the minigames gave off on the original versions due to my lessened experience at the time."
                        }
                    ]
                },
                {
                    "title": "Screenshots",
                    "values": [
                        {
                            "type": "image",
                            "value": "/static/projects/codware2/cw2_arena_fp.jpg",
                            "subtitle": "The main CODWare 2 Island arena."
                        },
                        {
                            "type": "image",
                            "value": "/static/projects/codware2/cw2_breaktarget_fp.jpg",
                            "subtitle": "\"Break 3 Targets!\" boss game arena."
                        },
                        {
                            "type": "image",
                            "value": "/static/projects/codware2/cw2_instruct_fp.jpg",
                            "subtitle": "\"Speed Up!\" minigame mechanic that increases minigame speed."
                        },
                        {
                            "type": "image",
                            "value": "/static/projects/codware2/cw2_shark_fp.jpg",
                            "subtitle": "\"Avoid the Shark\" minigame arena."
                        },
                        {
                            "type": "image",
                            "value": "/static/projects/codware2/cw2_victor_fp.jpg",
                            "subtitle": "Player victory screen."
                        },
                        {
                            "type": "outbound-url",
                            "value": "Visit Project"
                        }
                    ]
                }
            ],
            "launchdate": "Feb 2020",
            "url": "https://steamcommunity.com/sharedfiles/filedetails/?id=1998420705"
        },
        {
            "name": "alienvs",
            "title": "Extinction: Ground War",
            "logoimage":"ground-war-logo.png",
            "type": "game",
            "launchdate": "Incomplete - 2020"
        },
        {
            "name": "smash",
            "title": "Smash Ops",
            "coverimage":"smashops-cover.png",
            "logoimage":"smash_ops_logo.png",
            "type": "game",
            "launchdate": "Oct 2018",
            "content": [
                {
                    "title": "Project Information",
                    "values": [
                        {
                            "type": "youtube",
                            "value": "https://www.youtube.com/embed/D6xD4lnIafc"
                        },
                        {
                            "type": "text",
                            "value": "Smash Ops was my second attempt at creating a PvP gamemode in Call of Duty. This gamemode was a more direct PvP approach -- players were tasked with eliminating each other to be the last one standing, or earn the most eliminations, depending on which game type players chose. This project involved exercising my abilities to create systems and integrate into existing systems, and provided me with opportunities to balance weapons and characters for a fair PvP experience."
                        },
                        {
                            "type": "text",
                            "value": "This gamemode was intended to be a community-open project. Any developer within the community was intended to, at some point, be able to create maps and very quickly get Smash Ops up and running on them. Smash Ops only required a couple entities set up in order to get the game running; a few spawn points, locations for items to spawn, and playable bounds to mark where players are allowed to be to avoid elimination. It was heavily inspired by fighting games, namely \"Super Smash Brothers\" by Nintendo, but with a first-person spin on it."
                        },
                        {
                            "type": "text",
                            "value": "A project breakdown is available below, or you can click the \"Visit Project\" link above to check it out for yourself!"
                        }
                    ]
                },
                {
                    "title": "Responsibilities",
                    "values": [
                        {
                            "type": "text",
                            "value": "My responsibilities on this project included designing gameplay from conception to the final product, directing level designers on the philosophy behind creating maps for the mode, designing and scripting the UI and gamemode. I also handled creating/designing VFX and scripted the UI on the side, as well as creating the Final Destination stage from blockout to final product."
                        },
                        {
                            "type": "text",
                            "value": "This project allowed me to learn a lot about balancing and taking in feedback from a QA group. I was able to learn what players liked fighting, disliked fighting, and how to tweak weapons and characters to make the game feel enjoyable to play and not like any character was immediately better than the rest."
                        },
                        {
                            "type": "text",
                            "value": "In designing and developing the Final Destination stage, I was able to create a fake 3D animated skybox by attaching a very large VFX element to the player's camera, and using timers to swap to other VFX elements to fake the feel of the stage \"moving\" through space."
                        },
                        {
                            "type": "text",
                            "value": "Languages Used: GSC (Call of Duty Scripting Language), Lua"
                        }
                    ]
                },
                {
                    "title": "Gameplay Breakdown",
                    "values": [
                        {
                            "type": "image",
                            "value": "/static/projects/smash/so_finaldest.png",
                            "subtitle": "Final Destination, one of the stages available."
                        }
                    ]
                }
            ]
        },
        {
            "name": "bossrush",
            "title": "Boss Rush",
            "coverimage":"bossrush-cover.png",
            "logoimage":"boss-rush-infinite.png",
            "type": "game",
            "content": [
                {
                    "title": "Project Information",
                    "values": [
                        {
                            "type": "youtube",
                            "value": "https://www.youtube.com/embed/io_geMEyhek"
                        },
                        {
                            "type": "outbound-url",
                            "value": "Visit Project"
                        },
                        {
                            "type": "text",
                            "value": "Boss Rush was a modification project developed for Call of Duty: Black Ops 3 centered around introducing a new Player vs Environment mode. As an avid fan of Sonic games, I decided to start I would create new ways to experience battles against some of my favorite characters from the games — having knowledge of the data structures from these games, they were good choices for asset pulling to create full experiences. These namely included two characters known as the Nega-Wisp Armor and Infinite, with initial plans for more in the future. This mode was my first experience creating a from-scratch gamemode, using only the base multiplayer framework for Call of Duty: Black Ops 3 to branch off of, as well as my first experience building & scripting AI."
                        },
                        {
                            "type": "text",
                            "value": "The goal of this project was to create a flexible gamemode that would allow developers to easily introduce new enemies and encounters to the game by plugging into a core system, while also providing a fresh new gamemode for players to dive into. This core system would supply methods to track the time, score, lives, and declare victory and failure states for the game. The system also enabled management for hotjoining, and was my first venture into working with UI programming, involving a new heads-up-display for weapons, stats (such as score, time), and dynamic values such as boss health and name."
                        },
                        {
                            "type": "text",
                            "value": "A project breakdown is available below, or you can click the \"Visit Project\" link above to check it out for yourself!"
                        }
                    ]
                },
                {
                    "title": "Responsibilities",
                    "values": [
                        {
                            "type": "text",
                            "value": "My responsibilities on this project included leading the team, designing each encounter (incl. level blockout), structuring & writing the systems for the gamemode, structuring & writing the script that ran the AI for each encounter, VFX, and writing the code that displayed the UI and dynamically changed UI values on-screen."
                        },
                        {
                            "type": "text",
                            "value": "Throughout this project, I learned about AI concepts such as managing and using behavior systems, state trees, and navigation. I also developed a system that made it easy implement new maps and encounters into the gamemode."
                        },
                        {
                            "type": "text",
                            "value": "Languages Used: GSC (Call of Duty Scripting Language), Lua"
                        }
                    ]
                },
                {
                    "title": "Gameplay Breakdown",
                    "values": [
                        {
                            "type": "text",
                            "value": "Boss Rush's structure is split into encounters, with the gamemode's system encompassing each encounter. Each encounter is a separate map file, and sets the players up to fight through a sequence, whether it be one enemy or several. When an encounter is complete, players are returned to the menu and can choose another map (or encounter) to load into."
                        },
                        {
                            "type": "image",
                            "value": "/static/projects/bossrush/br_lobby_fp.jpg",
                            "subtitle": "The \"pre-game lobby\" inside of Boss Rush."
                        },
                        {
                            "type": "text",
                            "value": "Each encounter follows the same pre-game structure — when starting a match, players would be thrown into a \"pre-game lobby\" of sorts where players could wait, choose loadouts and plan before starting the game. Players would start an encounter by walking into the large black hole on the far side of the lobby. Once the black hole was entered, late-joining players would no longer be allowed to spawn — this was a gameplay rule set so that people couldn't leave and rejoin once they were out of lives. This lobby was part of every encounter map, and was required in order for your map to run the gamemode properly."
                        },
                        {
                            "type": "text",
                            "value": "The pre-game lobby setup helped each encounter feel part of the same connected world. The intention was for the player to acknowledge that, in-world, Infinite was creating each of these encounters, as his character centers around creating \"illusions\" that feel very much real; as a result, the pre-game lobby was designed after Sonic Forces' \"Null Space\" area — a location between realities that Infinite creates things from."
                        },
                        {
                            "type": "text",
                            "value": "Upon starting an encounter, all players will be moved into the encounter play area and will be greeted with a cutscene. Each encounter has its own, unique live intro cinematic to help make each encounter feel special, and set an initial tone for the upcoming battle. At this point, the game's state is now mid-battle — the timer will start, players will lose lives upon death, and players will also begin to have their score tracked."
                        },
                        {
                            "type": "image",
                            "value": "/static/projects/bossrush/br_negawisp_score.jpg",
                            "subtitle": "End-of-match score screen."
                        },
                        {
                            "type": "text",
                            "value": "At the end of the game, a score screen will pop-in and display the player's personal final score. The player's score is based on how quickly they completed the encounter, as well as an additional bonus for the number of lives they maintained by the end of the encounter. The time score is relative to a \"par time\", which is determined per-boss. If the players get better than the \"par time\", they get a massive score bonus."
                        }
                    ]
                },
                {
                    "title": "Breakdown: Nega-Wisp Armor",
                    "values": [
                        {
                            "type": "image",
                            "value": "/static/projects/bossrush/br_negawisp_fp.jpg",
                            "subtitle": "Mid-encounter against the Nega-Wisp Armor, one of the two encounters available at launch."
                        },
                        {
                            "type": "text",
                            "value": "The Nega-Wisp Armor is the first encounter of the two available at launch. This fight is designed to constantly be a constantly moving linear push, so the enemy will maintain a specific distance from the player and travel along the ring at the player's pace. Players are forced to keep moving by a \"death wall\" that moves slightly slower than the player's sprinting speed — this keeps a sense of urgency, and ensures that players will keep moving and maintain the pace of the encounter."
                        },
                        {
                            "type": "text",
                            "value": "The Nega-Wisp Armor enemy AI is designed to properly change its forward distance from the player depending on the action — for instance, when doing the \"Cube\" attack, the enemy will move much further down the track to place down a maze of cubes that players must navigate through, while during the \"Laser\" attack, the enemy will only move forward a small amount to drag a laser beam across the field, making players chain jumps and slides together in order to avoid taking damage."
                        },
                        {
                            "type": "text",
                            "value": "This enemy's design is a phase weak-points fight. Once the enemy has completed a certain chain number of attacks (which increases from 1 to 3 depending on how low the enemy's health is), the enemy will enter an \"idle\" state where a part of their body is weak to damage. Each weak point has a damage threshold, and once that damage threshold is reached, the enemy will react to the damage and flinch. During the flinch recovery animation, players will need to reach a second damage threshold check — which increases based on living player count. Upon reaching this second damage threshold, the enemy will take a large amount of damage and become stunned. This presents an option to the players — if they react quick enough, they can impact the enemy with an explosive or melee weapon, and deal a critical strike with a massive amount of damage that will launch the enemy further down the track. If the players do this optional piece, they will have a little bit of time to breathe before the enemy gets up, recovers and moves closer to the players again."
                        },
                        {
                            "type": "image",
                            "value": "/static/projects/bossrush/br_negawisp_ko_fp.jpg",
                            "subtitle": "The Nega-Wisp Armor after being hit with a critical strike."
                        },
                        {
                            "type": "text",
                            "value": "The overarcing objective of the Nega-Wisp Armor encounter is to free 8 of the Wisp aliens from the enemy. A Wisp alien will be freed once the enemy reaches certain health thresholds, split up into eighths. Once a player frees a Wisp, it will act like a familiar and will orbit the player idly. This is a visual, in-world way to show the player's progression and was a fun little feature to experiment with. Players enjoyed this and talked about the familiars like they were their own little buddies! If a player is eliminated or runs out of lives while having a Wisp familiar, the familiar will choose the closest player to latch onto and will choose that player to follow until they need to change players again."
                        },
                        {
                            "type": "image",
                            "value": "/static/projects/bossrush/br_negawisp_end_fp.jpg",
                            "subtitle": "All wisps having been obtained and forming a ring."
                        },
                        {
                            "type": "text",
                            "value": "Once all Wisps have been freed, players will be prompted to press their jump button to have the Wisps unite. Each Wisp's name will be announced by the voice-over, and it will enter a state where it forms a ring with all of the other \"Wisps\". After all of their names have been called out, any player can hop into the formed ring and deal the final blow to the Nega-Wisp Armor, knocking the enemy far away and ending the encounter. This will trigger the game to end, the timer will stop, and each player will be presented with their score card."
                        },
                        {
                            "type": "text",
                            "value": "Visual Level Design in these screenshots attributed to Exofile and Tatsu, two project members."
                        }
                    ]
                },
                {
                    "title": "Breakdown: Infinite",
                    "values": [
                        {
                            "type": "image",
                            "value": "/static/projects/bossrush/br_infinite_intro.jpg",
                            "subtitle": "The introduction cutscene against Infinite."
                        },
                        {
                            "type": "text",
                            "value": "Infinite is the second of the two available encounters. This encounter is designed to be a lot more freeing than the Nega-Wisp Armor encounter. In this encounter, the enemy is about the same size as the player, and can fly around the playspace freely. The enemy will choose a favorite target depending on a \"threat bias\", then will attack that target accordingly. Other players can easily tell who this enemy is targeting, as the enemy will always stay a certain distance away from their target."
                        },
                        {
                            "type": "text",
                            "value": "This arena is a circle shape with a donut hole in the middle, provide a few fall hazards to keep players on their toes. Around the arena are small abnormalities, like pillars and pits, to make the environment feel more varied. I was fairly limited in how this arena was designed because it needed to fit the \"Null Space\" aesthetic, which is largely made up of grid-locked cubes. The final design didn't evolve much past the blockout."
                        },
                        {
                            "type": "image",
                            "value": "/static/projects/bossrush/br_infinite_diving_fp.jpg",
                            "subtitle": "Infinite diving towards the player."
                        },
                        {
                            "type": "text",
                            "value": "Infinite's attacks are all designed for single-player targeting, and all interact in a way that requires the player have to make quick, split-second decisions to avoid taking damage. As Infinite's health drops, he will chain more attacks before changing phases, introduce more attacks, and mutate pre-existing attacks. For instance, Infinite's initial attack list involves throwing three homing projectiles at their target — but once the health drops to 60%, the number of projectiles will double. These reactive changes are designed to give the player a sense of urgency that Infinite is becoming more irritated, therefore throwing more at the player in order to stop them."
                        },
                        {
                            "type": "image",
                            "value": "/static/projects/bossrush/br_infinite_pillars_fp.jpg",
                            "subtitle": "Infinite's reactive difficulty pillar attack."
                        },
                        {
                            "type": "text",
                            "value": "Some of Infinite's reactive difficulty changes involve adding a new attack. This attack has Infinite summon a few pillars with lightning arcing off of them — something clearly very dangerous! Infinite will then scatter these around their target player, creating a sort of \"cage\" around the player that lasts for ~1 minute. This cage is easily escapable, but if the player panics too hard, they will take a lot of damage before escaping the cage due to running into the pillars. This attack was added in order to slightly change up the flow of fighting Infinite, and enable him to take control of the play area a little bit more."
                        },
                        {
                            "type": "image",
                            "value": "/static/projects/bossrush/br_infinite_healing_fp.jpg",
                            "subtitle": "Infinite during the healing phase."
                        },
                        {
                            "type": "text",
                            "value": "The design of this fight is a damage-per-second fight with attack windows. During the duration of the fight, Infinite will have a red shield encapsulating them that will block all forms of incoming damage. After a certain number of attacks have been chained (which depends on the reactive difficulty), Infinite will teleport to the center of the arena and drop his shield to recharge it and heal himself. During this phase, a DPS check occurs in which players can do a certain amount of damage before Infinite is done recharging — during which Infinite takes 1/2 incoming damage. If successful, Infinite will become stunned and will take full incoming damage while recovering from the stun. The stun, and heal phase, both last a different length based on the number of players in the match. When the reactive difficulty reaches a certain point, Infinite will instead fire an attack at players and juke to the side before entering his recharge state."
                        },
                        {
                            "type": "image",
                            "value": "/static/projects/bossrush/br_infinite_outro.jpg",
                            "subtitle": "Infinite during the outro cutscene."
                        },
                        {
                            "type": "text",
                            "value": "Upon depleting Infinite's health pool, the game will enter a cutscene state with an in-game rendered outro cinematic. Once this scene is completed, the game will end, the timer will stop and players will have their score reported to them."
                        },
                        {
                            "type": "outbound-url",
                            "value": "Visit Project"
                        }
                    ]
                }
            ],
            "url": "https://steamcommunity.com/sharedfiles/filedetails/?id=1532706684",
            "launchdate": "Oct 2018"
        },
        {
            "name": "mindshare",
            "title": "Mindshare",
            "coverimage":"mindshare-cover.png",
            "logoimage":"mindshare-icon.png",
            "type": "game",
            "launchdate": "Sep 2017",
            "content": [
                {
                    "title": "Project Information",
                    "values": [
                        {
                            "type": "youtube",
                            "value": "https://www.youtube.com/embed/jNZ_DUbaCZI"
                        }   
                    ]
                }
            ]
        },
        {
            "name": "codware",
            "title": "CODWare",
            "coverimage":"codware-cover.jpg",
            "logoimage":"codware-logo.png",
            "type": "game",
            "url": "https://steamcommunity.com/sharedfiles/filedetails/?id=892207782",
            "launchdate": "Mar 2017",
            "content": [
                {
                    "title": "Project Information",
                    "values": [
                        {
                            "type": "youtube",
                            "value": "https://www.youtube.com/embed/IXloZKbsz0I"
                        },
                        {
                            "type": "text",
                            "value": "CODWare was my first attempt at a PvP gamemode in a full-scale playercount (18 players maximum), as well as my first dive into a \"live-service\" approach for a project. This gamemode was what made me fall in love with developing PvP-type games, and also gave me an opportunity to develop a from-scratch gamemode to change Call of Duty into my own experience -- taking the standard PvP gameplay of the game, and spinning it on its head to be a fun, hop-in-and-go party game."
                        },
                        {
                            "type": "text",
                            "value": "This gamemode initially started as a remake of the \"TF2Ware\" custom gamemode in Call of Duty, but eventually evolved into something more, adding new features, new minigames, and evolving past being only a remake. I introduced customization options, pre-game lobbies, unique new minigame ideas, and even took advantage of existing Call of Duty mechanics to create these minigames, such as wallrunning and jetpacks."
                        }
                    ]
                },
                {
                    "title": "Responsibilities",
                    "values": [
                        {
                            "type": "text",
                            "value": "My responsibilities on this project included designing the gamemode from conception to the final product, scripting the gamemode and systems, and directing the level designer on the requirements for the arenas and minigames."
                        }
                    ]
                },
                {
                    "title": "Gameplay Breakdown",
                    "values": [
                        {
                            "type": "text",
                            "value": "The flow of CODWare and its sequel begins with all of the players getting thrown into an primary arena together. While in this area, players can all see each other and hit each other with their chosen melee weapon, but no players can take damage. This lets players toy with each other and creates a bit of a \"punching bag\" effect for between rounds. During this introduction sequence, the game logic will roll to see if a \"Special Round\" should be enabled, which changes or adds fundamental rules of the game. After the introduction sequence is complete, the standard gameplay loop begins. This loop involves choosing one minigame from the full list of available minigames, and initializes it."
                        },
                        {
                            "type": "image",
                            "value": "/static/projects/codware/cw_hatchet_fp.jpg",
                            "subtitle": "\"Hatchet Toss\" minigame."
                        },
                        {
                            "type": "text",
                            "value": "Each minigame active is global, and every player that is part of the match is always involved in the minigame, so long as they have not been permanently disqualified by a special rule. When partcipating, players will earn 1 point if they successfully complete the minigame's instructions. Some minigames require a player to do something individually, i.e. \"Nailgun Jump\", while some require players to interact with each other directly, i.e. \"Kill an Enemy\",  — minigames all have variety, and all play very differently from each other, with each goal requiring players to have to adjust quickly."
                        },
                        {
                            "type": "image",
                            "value": "/static/projects/codware/cw_nailjump_fp.jpg",
                            "subtitle": "\"Nailgun Jump\" minigame."
                        },
                        {
                            "type": "text",
                            "value": "When a minigame begins, its instructions are displayed on the top of the player's HUD. Some instructions are straight forward, while some involve wordplay — for example, in this minigame, players will be told to \"Fight and Stay Alive\". Instinctively, players begin to fight each other and eliminate each other, but cunning players will understand that the instructions of the minigame state specifically to stay alive. If the player avoids conflict, without actually eliminating another player, they will earn a point. As the game goes on, minigames will increase in speed (or become shorter in duration), this tests players' ability to react and pushes them towards understanding each minute part of a minigame to make sure they can complete it in time."
                        },
                        {
                            "type": "text",
                            "value": "Some minigames have special arenas to help shake things up and introduce new rules. A minigame like \"Avoid the Shark\" takes place inside of a pool, with one player acting as a \"shark\" while the other players have to avoid getting eliminated by that player. Another example of this is \"Get to the End\" — a minigame where players are teleported into an obstacle course, and are required to get to the end of the obstacle course before time runs out."
                        },
                        {
                            "type": "image",
                            "value": "/static/projects/codware/cw_platform_fp.jpg",
                            "subtitle": "\"Get on a Platform!\" minigame."
                        },
                        {
                            "type" :"text",
                            "value": "Once a certain number of minigames is completed (typically 15), all players will need to participate in a \"Boss Round\" — these games are longer, larger minigames that sometimes pit players against each other in teams. The goals for these games can range from surviving in an asymmetrical setting, traveling a long obstacle course, shooting a number of targets and more. These rounds will reward the victorious player(s) with five points total rather than one point — these rounds are often used as an opportunity to snipe a win away from someone, allowing players to tip the scales by winning one of these rounds."
                        },
                        {
                            "type": "text",
                            "value": "Some boss minigames may introduce extra special, invisible rules — for example, the \"Break the Target\" boss minigame allows players to kill each other with their supplied weapon. A killed player during this minigame is not eliminated, but will incur a respawn penalty, which will vastly reduce the amount of time they have to break targets."
                        },
                        {
                            "type": "image",
                            "value": "/static/projects/codware/cw_margwa_fp.jpg",
                            "subtitle": "\"Break the Target\" minigame and special arena."
                        },
                        {
                            "type": "text",
                            "value": "After completing the boss game, all of the players' scores will be tallied up and compared. The player with the most points will be declared the victor, and it will be announced to the server. The victorious player is given their loadout (built by the player before loading into the match) and invulnerability. During this victory period, the winning player is allowed to recklessly kill all of the other players, while the other players cannot hurt each other or the victor. During the next match, the winning player will also be given a crown to represent their victory. This acts as a small reward, and allows the victorious player to have an \"in your face!\" moment to their friends and opponents."
                        },
                        {
                            "type": "text",
                            "value": "Once the victory period is complete, the match will automatically start anew. CODWare 2 is designed as a \"play until you're tired\" type of game — so this gamemode-restart cycle will continue until the host ends the game or all players leave."
                        },
                        {
                            "type": "outbound-url",
                            "value": "Visit Project"
                        }
                    ]
                },
                {
                    "title": "\"Live Service\"",
                    "values": [
                        {
                            "type": "image",
                            "value": "/static/projects/codware/cw_eggbot_invasion_fp.jpg",
                            "subtitle": "\"Dr. Robotnik's Invasion\" title card."
                        },
                        {
                            "type": "text",
                            "value": "CODWare was my first attempt at \"live service\"; we had updates planned that would add new minigames and events. Due to time circumstances with my professional life, this \"live service\" dream wasn't quite realized past our first event, but the first event was still quite an enjoyable success that many players enjoyed coming back to the game for."
                        },
                        {
                            "type": "text",
                            "value": "The first (and unfortunately last) event for CODWare was one themed after my favorite character in gaming \"Dr. Robotnik\" -- this is, of course, a fan project and has no direct affiliation with SEGA. The event, \"Dr. Robotnik's Invasion\", introduced a few new quality-of-life features, as well as five new minigames and three new boss minigames and an update to the atmosphere & environment. I had our level designer build \"audience stands\" into the main arena, which allowed me to add a fake audience of animated robotniks built by Dr. Robotnik -- I can't help but to add a little bit of extra atmosphere!"
                        },
                        {
                            "type": "image",
                            "value": "/static/projects/codware/cw_robotnik_battle_fp.jpg",
                            "subtitle": "\"Dr. Robotnik's Invasion\" title card."
                        },
                        {
                            "type": "text",
                            "value": "Events were a secondary structure to CODWare in this update, and added a couple fun features. When an event was active, just before the minigame sequence started, a special \"intro scene\" with an event logo would pop up to notify players that they are playing a limited-time, event version of CODWare. On top of this, the new minigames had a higher chance of being pulled from the pool, and players would always fight the \"Dr. Robotnik\" boss minigame at the end of a match in addition to the . Eventually, having to play this minigame at the end of every match became dull for players, so I ended up pulling that feature and just moved Robotnik into the boss games pool."
                        },
                        {
                            "type": "image",
                            "value": "/static/projects/codware/cw_robotnik_update_fp.jpg",
                            "subtitle": "\"Dr. Robotnik's Invasion\" title card."
                        },
                        {
                            "type": "text",
                            "value": "These games also gave me an opportunity to introduce a new type of minigame: a competitive co-op minigame. In these minigames, every player would be pit up against a common enemy. Players who did the most damage to this common enemy would earn bonus points, and players who survived at all would qualify for points. Perma-death occurs during these games, so if all players die, everyone fails and nobody will earn any points, even if someone makes the most damage."
                        },
                        {
                            "type": "text",
                            "value": "Once the event concludes, the minigame weighting is returned to normal, and all special event minigames are moved into the regular pool. Arena theming changes back to normal, but leaves behind a small mark of the previous event's theme permanently -- we wanted to give this arena a \"history\" as we pushed more events into the game."
                        },
                        {
                            "type": "text",
                            "value": "Working on this update was very fun; it gave me the opportunity to evolve my gamemode and its structure, as well as play with a lot of new ideas, and give the environment a whole fresh atmosphere. Some things were very tricky to execute in the Call of Duty engine, but I put some extra effort in to bend the engine and make everything play the way I had in my head. Overall, this update was enjoyable to work on and I would love to do it again given the time and resources."
                        },
                        {
                            "type": "outbound-url",
                            "value": "Visit Project"
                        }
                    ]
                }
            ]
        }
    ],
    "pro": [
        {
            "name": "mojivr",
            "title": "MojiLife VR",
            "coverimage": "mojilife-vr-cover.jpg",
            "logoimage":"mojilife-vr-logo.png",
            "type": "web",
            "url": "https://www.mojilifevr.com",
            "launchdate": "Jan 2018"
        },
        {
            "name": "mojilife",
            "title": "MojiLife",
            "coverimage": "mojilife-cover.jpg",
            "logoimage":"mojilife-logo.png",
            "type": "web",
            "url": "https://www.mojiproducts.com",
            "launchdate": "Dec 2016 - 2020"
        }
    ]
}